RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.c

/***************************************************************************//**
* \file cy_usb_dev_cdc.c
* \version 2.10
*
* Provides Class Specific API implementation.
*
********************************************************************************
* \copyright
* (c) 2018-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_usb_dev_cdc.h"
#include "cy_usb_dev_cdc_descr.h"

#if (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS))


/*******************************************************************************
*                                Internal Constants
*******************************************************************************/

#define COM1        (0U)
#define COM2        (1U)
#define INVALID_COM (0xFFU)
#define IS_COM_VALID(com)   CY_USB_DEV_CDC_IS_COM_VALID(com)

#define SET_LINE_CODING_LENGTH                  (7U)
#define LINE_CODING_RATE_OFFSET                 (0U)

#define SERIAL_STATE_REQUEST_TYPE               (0xA1U)
#define SERIAL_STATE                            (0x20U)
#define SERIAL_STATE_LENGTH                     (0x2U)

#define SERIAL_STATE_WINDEX_OFFSET              (4U)
#define SERIAL_STATE_WSERIALSTATE_LSB_OFFSET    (8U)
#define SERIAL_STATE_WSERIALSTATE_MSB_OFFSET    (9U)

#define SINGLE_COM_PORT_EP_NUM                  (3U)
#define DUAL_COM_PORT_EP_NUM                    (6U)

#define INTERFACE_CLASS_POS                     (5U)

#define INIT_LINES_CODING \
{                         \
    /* dwDTERate: Data terminal rate, in bits per second */ \
    0x00U, 0xC2U, 0x01U, 0x00U, \
    /* bCharFormat (Stop bits): 0 - 1bit, 1 - 1.5bits, 2 - 2bits */ \
    0x00U, \
    /* bParityType: Parity 0 - None, 1 - Odd, 2 - Even, 3 - Mark, 4 - Space */ \
    0x00U, \
    /*  Data bits (5, 6, 7, 8 or 16) */ \
    0x08U \
}

#define INIT_SERIAL_STATE \
{                         \
    SERIAL_STATE_REQUEST_TYPE,/* bRequestType    */ \
    SERIAL_STATE,             /* bNotification   */ \
    0U,                       /* wValue          */ \
    0U,                       /* wValueMSB       */ \
    0U,                       /* wIndex          */ \
    0U,                       /* wIndexMSB       */ \
    SERIAL_STATE_LENGTH,      /* wLength         */ \
    0u,                       /* wLengthMSB      */ \
    0U,                       /* wSerialState    */ \
    0U,                       /* wSerialStateMSB */ \
}


/*******************************************************************************
*                            Internal Functions
*******************************************************************************/

static cy_en_usb_dev_status_t HandleRequest(cy_stc_usb_dev_control_transfer_t *transfer, void *classContext,
                                            cy_stc_usb_dev_context_t *devContext);

static cy_en_usb_dev_status_t HandleRequestComplete(cy_stc_usb_dev_control_transfer_t *transfer,
                                                      void *classContext,
                                                      cy_stc_usb_dev_context_t *devContext);

static cy_en_usb_dev_status_t HandleSetConfig(uint32_t configuration,
                                              void *classContext,
                                              cy_stc_usb_dev_context_t *devContext);

static uint32_t GetInterfaceComPort(uint32_t interface, cy_stc_usb_dev_cdc_context_t const *context);

static uint32_t ReadInternalBuffer(cy_stc_usb_dev_cdc_comport_t* port, uint8_t *buffer,
                                   uint32_t size);

static bool IsEndpointReady(uint32_t endpoint, cy_stc_usb_dev_context_t const *context);

static cy_stc_usb_dev_cdc_comport_t* GetCom(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_Init
****************************************************************************//**
*
* Initializes the CDC class.
* This function must be called to enable USB Device CDC functionality.
*
* \param config
* The pointer to the CDC configuration
* structure \ref cy_stc_usb_dev_cdc_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \param devContext
* The pointer to the USB Device context structure \ref cy_stc_usb_dev_context_t.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_CDC_Init(cy_stc_usb_dev_cdc_config_t  const *config,
                                           cy_stc_usb_dev_cdc_context_t       *context,
                                           cy_stc_usb_dev_context_t           *devContext)
{
    if ((NULL == context) || (NULL == devContext))
    {
        return CY_USB_DEV_BAD_PARAM;
    }

    uint32_t portIndex;

    for (portIndex = 0UL; (portIndex < CY_USB_DEV_CDC_COMPORT_NUMBER); portIndex++)
    {
        /* Default value for Lines Coding and Serial State notification */
        const uint8_t initLinesCoding[CY_USB_DEV_CDC_LINE_CODING_SIZE]  = INIT_LINES_CODING;
        const uint8_t initSerialState[CY_USB_DEV_CDC_SERIAL_STATE_SIZE] = INIT_SERIAL_STATE;

        /* Get COM port */
        cy_stc_usb_dev_cdc_comport_t* com = &context->port[portIndex];

        /* Initialize default values: lines coding and serial state */
        (void) memcpy((void *) com->linesCoding, (const void *)initLinesCoding, CY_USB_DEV_CDC_LINE_CODING_SIZE);
        (void) memcpy((void *) com->serialStateNotification, (const void *)initSerialState, CY_USB_DEV_CDC_SERIAL_STATE_SIZE);

        /* Set COM port disable */
        com->valid = false;
        com->writeBufIdx  = 0U;
        com->readBufIdx   = 0U;
        com->linesChanged = CY_USB_DEV_CDC_LINE_NOT_CHANGED;

        /* Copy data from configuration */
        com->buffer     = (NULL != config) ? config->buffer[portIndex] : NULL;
        com->bufferSize = (NULL != config) ? config->bufferSize[portIndex] : 0U;
    }

    /* Remove custom handlers */
    context->requestCompleted = NULL;
    context->requestReceived  = NULL;

    /* Store device context */
    context->devContext = devContext;

    /* Register CDC handlers */
    Cy_USB_Dev_RegisterClassSetConfigCallback(&HandleSetConfig, Cy_USB_Dev_CDC_GetClass(context));
    Cy_USB_Dev_RegisterClassRequestRcvdCallback(&HandleRequest, Cy_USB_Dev_CDC_GetClass(context));
    Cy_USB_Dev_RegisterClassRequestCmpltCallback(&HandleRequestComplete, Cy_USB_Dev_CDC_GetClass(context));

