RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.c
    return Cy_USB_Dev_RegisterClass(&context->classItem, &context->classObj, context, devContext);
}


/*******************************************************************************
* Function Name: HandleSetConfig
****************************************************************************//**
*
* Handles SET_CONFIGURATION request event. This function finds COM ports
* information for a certain configuration: CDC interfaces and CDC endpoints.
* This information is used to call any CDC function.
*
* \param configuration
* The CDC configuration index.
*
* \param classContext
* The pointer to the context structure of the Class
* \ref cy_stc_usb_dev_cdc_context_t allocated by the user.
*
* \param devContext
* The pointer to the context structure of the Device
* \ref cy_stc_usb_dev_context_t allocated by the user.
*
* \return
* Returns \ref CY_USB_DEV_SUCCESS.
* The configuration is still valid if COM port is not found.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleSetConfig(uint32_t configuration,
                                              void *classContext,
                                              cy_stc_usb_dev_context_t *devContext)
{
    /* Get CDC context */
    cy_stc_usb_dev_cdc_context_t *context = (cy_stc_usb_dev_cdc_context_t *) classContext;

    /* Invalidate COM ports */
    context->port[COM1].valid = false;
    context->port[COM2].valid = false;

    if (configuration > 0U)
    {
        /* Get current configuration */
        cy_stc_usb_dev_configuration_t const *config = devContext->devDescriptors->configurations[configuration - 1U];

        uint32_t intf;
        uint32_t portInt  = 0U;
        uint32_t portData = 0U;
        uint32_t cdcEpNum = 0U;

        for (intf = 0U; intf < config->numInterfaces; ++intf)
        {
            /* CDC does not support alternate settings */
            uint32_t alt = 0U;

            /* Get alternate settings that belong to this interface */
            cy_stc_usb_dev_alternate_t const **altStructs = config->interfaces[intf]->alternates;

            /* Get pointer to current alternate descriptor */
            cy_stc_usbdev_interface_descr_t const *curAlternate = (cy_stc_usbdev_interface_descr_t const *)
                                                                   ((const void *)(altStructs[alt]->interfaceDescriptor));

            /* Check interface class */
            if (CY_USB_DEV_CDC_CLASS == curAlternate->bInterfaceClass)
            {
                /* Get endpoint descriptor */
                cy_stc_usbdev_endpoint_descr_t const *ep = (cy_stc_usbdev_endpoint_descr_t const *)
                                                            ((const void *)(altStructs[alt]->endpoints[0U]->endpointDescriptor));

                context->port[portInt].interfaceNum = (uint8_t) intf;

                context->port[portInt].commEp       = (uint8_t) CY_USB_DEV_EPADDR2EP(ep->bEndpointAddress);
                context->port[portInt].commEpSize   = CY_USB_DEV_GET_CFG_WORD(&ep->wMaxPacketSize);
                context->port[portInt].serialStateNotification[SERIAL_STATE_WINDEX_OFFSET] = (uint8_t) intf;

                portInt = 1U;
                cdcEpNum++;
            }
            else if (CY_USB_DEV_CDC_CLASS_DATA == curAlternate->bInterfaceClass)
            {
                uint32_t endpoint;

                /* Check all endpoints that belong to interface */
                for (endpoint = 0U; endpoint < altStructs[alt]->numEndpoints; ++endpoint)
                {
                    /* Get endpoint descriptor */
                    cy_stc_usbdev_endpoint_descr_t const *ep = (cy_stc_usbdev_endpoint_descr_t const *)
                                                                ((const void *)(altStructs[alt]->endpoints[endpoint]->endpointDescriptor));

                    if (CY_USB_DEV_IS_EP_DIR_IN(ep->bEndpointAddress))
                    {
                        context->port[portData].dataInEp     = (uint8_t) CY_USB_DEV_EPADDR2EP(ep->bEndpointAddress);
                        context->port[portData].dataInEpSize = CY_USB_DEV_GET_CFG_WORD(&ep->wMaxPacketSize);
                    }
                    else
                    {
                        context->port[portData].dataOutEp     = (uint8_t) CY_USB_DEV_EPADDR2EP(ep->bEndpointAddress);
                        context->port[portData].dataOutEpSize = CY_USB_DEV_GET_CFG_WORD(&ep->wMaxPacketSize);

                        /* Enable endpoint to receive data from Host.
                        * Discard status after set configuration is safe.
                        */
                        (void) Cy_USB_Dev_StartReadEp((uint32_t) context->port[portData].dataOutEp, devContext);
                    }

                    cdcEpNum++;
                }

                portData = 1U;
            }
            else
            {
                /* Skip: Interface Class is not CDC */
            }
        }

        context->port[COM1].valid = (cdcEpNum >= SINGLE_COM_PORT_EP_NUM);
        context->port[COM2].valid = (DUAL_COM_PORT_EP_NUM == cdcEpNum);
    }

    /* If comport is not found, it is marked not valid */
    return CY_USB_DEV_SUCCESS;
}


/*******************************************************************************
* Function Name: HandleRequest
****************************************************************************//**
*
* Handles CDC class requests (SETUP packet received event).
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param classContext
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \param devContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for
* internal configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleRequest(cy_stc_usb_dev_control_transfer_t *transfer,
                                            void *classContext,
                                            cy_stc_usb_dev_context_t *devContext)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Process CDC Class requests */
    if (CY_USB_DEV_CLASS_TYPE == transfer->setup.bmRequestType.type)
    {
        cy_stc_usb_dev_cdc_context_t *context = (cy_stc_usb_dev_cdc_context_t *) classContext;

        uint32_t portNum = GetInterfaceComPort((uint32_t) transfer->setup.wIndex, context);

