RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.c
        if (IS_COM_VALID(portNum))
        {
            switch (transfer->setup.bRequest)
            {
                case CY_USB_DEV_CDC_RQST_SET_LINE_CODING:
                {
                    transfer->remaining = SET_LINE_CODING_LENGTH;
                    transfer->notify    = true;
                    retStatus = CY_USB_DEV_SUCCESS;
                }
                break;

                case CY_USB_DEV_CDC_RQST_GET_LINE_CODING:
                {
                    transfer->ptr       = (uint8_t *) context->port[portNum].linesCoding;
                    transfer->remaining = SET_LINE_CODING_LENGTH;
                    retStatus = CY_USB_DEV_SUCCESS;
                }
                break;

                case CY_USB_DEV_CDC_RQST_SET_CONTROL_LINE_STATE:
                {
                    context->port[portNum].linesControlBitmap = (uint8_t) transfer->setup.wValue;
                    context->port[portNum].linesChanged |= CY_USB_DEV_CDC_LINE_CONTROL_CHANGED;
                    retStatus = CY_USB_DEV_SUCCESS; /* There is Data stage */
                }
                break;

                default:
                {
                    /* Request was not recognized. Try custom request handler. */
                    if (NULL != context->requestReceived)
                    {
                        retStatus = context->requestReceived(transfer, context, devContext);
                    }
                }
                break;
            }
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: HandleRequestComplete
****************************************************************************//**
*
* Completes handling CDC class requests that expect data from the Host.
* Involved when data from the Host has been received.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param classContext
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \param devContext
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for
* internal configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Status of request processing: \ref CY_USB_DEV_SUCCESS or
* \ref CY_USB_DEV_REQUEST_NOT_HANDLED.
*
*******************************************************************************/
static cy_en_usb_dev_status_t HandleRequestComplete(cy_stc_usb_dev_control_transfer_t *transfer,
                                                    void *classContext,
                                                    cy_stc_usb_dev_context_t *devContext)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    /* Process CDC Class requests */
    if (CY_USB_DEV_CLASS_TYPE == transfer->setup.bmRequestType.type)
    {
        cy_stc_usb_dev_cdc_context_t *context = (cy_stc_usb_dev_cdc_context_t *) classContext;

        uint32_t portNum = GetInterfaceComPort((uint32_t) transfer->setup.wIndex, context);

        if (IS_COM_VALID(portNum))
        {
            switch (transfer->setup.bRequest)
            {
                case CY_USB_DEV_CDC_RQST_SET_LINE_CODING:
                {
                    /* Copy received data */
                    (void) memcpy((void *) context->port[portNum].linesCoding, (const void *)transfer->ptr, CY_USB_DEV_CDC_LINE_CODING_SIZE);

                    context->port[portNum].linesChanged |= CY_USB_DEV_CDC_LINE_CODING_CHANGED;

                    retStatus = CY_USB_DEV_SUCCESS;
                }
                break;

                default:
                {
                    /* Request was not recognized. Try custom request handler. */
                    if (NULL != context->requestCompleted)
                    {
                        retStatus = context->requestCompleted(transfer, context, devContext);
                    }
                }
                break;
            }
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: GetInterfaceComPort
****************************************************************************//**
*
* Returns number of COM port number that belong to a certain CDC interface.
*
* \param interface
* Interface number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* COM port number (COM1 or COM2). INVALID_COM if COM port does not exist.
*
*******************************************************************************/
static uint32_t GetInterfaceComPort(uint32_t interface, cy_stc_usb_dev_cdc_context_t const *context)
{
    uint32_t portNum;
    uint32_t locInterface = (uint32_t) CY_LO8(interface);

    if (context->port[COM1].interfaceNum == locInterface)
    {
        portNum = COM1;
    }
    else if (context->port[COM2].interfaceNum == locInterface)
    {
        portNum = COM2;
    }
    else
    {
        portNum = INVALID_COM;
    }

    return (portNum);
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_PutData
****************************************************************************//**
*
* Sends a specified number of bytes to USB Host.
* Call \ref Cy_USB_Dev_CDC_IsReady function to ensure that the COM port
* (CDC Data interface) is ready for sending data to the USB Host before calling
* this function.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param buffer
* The pointer to the buffer containing data bytes to be sent. \n
* Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
* it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
* for more information).
*
* \param size
* The number of bytes to send.
* This value must be less than or equal to the maximum packet size of the
* CDC Data interface IN endpoint that belongs to the specified COM port.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_CDC_PutData(uint32_t port, uint8_t const *buffer, uint32_t size,
                                              cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_BAD_PARAM;
    cy_stc_usb_dev_cdc_comport_t* com = GetCom(port, context);

    if (com->valid)
    {
        retStatus = Cy_USB_Dev_WriteEpNonBlocking((uint32_t) com->dataInEp, buffer, size, context->devContext);
    }

