RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.c
    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_PutString
****************************************************************************//**
*
* Sends a null terminated string to the USB Host. This function is blocking and
* returns after successful USB Host transfer, or an error or timeout occurred.
* Call \ref Cy_USB_Dev_CDC_IsReady function to ensure that the COM port
* (CDC Data interface) is ready for sending data to the USB Host before calling
* this function.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param string
* The pointer to the string to be sent. \n
* The string must be allocated following rules in the section
* \ref group_usb_dev_ep_buf_alloc to be USBFS driver configuration
* independent.
*
* \param timeout
* Defines in milliseconds the time for which this function can block.
* If that time expires, the function returns.
* To wait forever, pass \ref CY_USB_DEV_WAIT_FOREVER.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
* \note
* If string parameter is a constant string (example: "USBUART"), it is stored
* in the stack and aligned to 4 bytes boundary what makes it USBFS
* driver configuration independent.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_CDC_PutString(uint32_t port, char_t const *string, int32_t timeout,
                                                cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_BAD_PARAM;
    cy_stc_usb_dev_cdc_comport_t* com = GetCom(port, context);

    if (com->valid)
    {
        uint32_t endpoint = com->dataInEp;
        uint32_t stringLen = strlen(string);
        uint32_t sendLen = 0U;
        uint32_t sendIndex = 0U;
        uint32_t bufSize = com->dataInEpSize;

        do
        {
            /* Send size equal to endpoint max packet sizes */
            sendLen = (stringLen > bufSize) ? bufSize : stringLen;

            retStatus = Cy_USB_Dev_WriteEpBlocking(endpoint, (uint8_t const *) &string[sendIndex],
                                                   sendLen, timeout, context->devContext);
            stringLen -= sendLen;
            sendIndex += sendLen;
        }
        while ((stringLen > 0U) && (CY_USB_DEV_SUCCESS == retStatus));

        /* If last packet is exactly maximum packet size, it shall be followed
        * by a zero-length packet to assure the end of segment is properly
        * identified by the terminal.
        */
        if ((sendLen == bufSize) && (CY_USB_DEV_SUCCESS == retStatus))
        {
            uint8_t dummyByte = 0U;
            retStatus = Cy_USB_Dev_WriteEpBlocking(endpoint, &dummyByte,
                                                   0U, timeout, context->devContext);
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetCount
****************************************************************************//**
*
* Returns the number of bytes that were received from the USB Host and can be
* read using \ref Cy_USB_Dev_CDC_GetData or \ref Cy_USB_Dev_CDC_GetChar
* functions.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Returns the number of bytes that were received.
*
*******************************************************************************/
uint32_t Cy_USB_Dev_CDC_GetCount(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    uint32_t count = 0U;
    cy_stc_usb_dev_cdc_comport_t *com = GetCom(port, context);

    if (com->valid)
    {
        /* Read number of bytes in local buffer */
        count = com->writeBufIdx;

        /* Local buffer is empty. Check if there is data in the endpoint buffer */
        if (0U == count)
        {
            if (IsEndpointReady((uint32_t) com->dataOutEp, context->devContext))
            {
                /* Update count if Host wrote anything into the endpoint */
                count = Cy_USB_Dev_GetEpNumToRead((uint32_t) com->dataOutEp, context->devContext);
            }
        }
    }

    return count;
}


/*******************************************************************************
* Function Name: GetCom
****************************************************************************//**
*
* Returns pointer to port structure cy_stc_usb_dev_cdc_comport_t
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Pointer to port structure cy_stc_usb_dev_cdc_comport_t
*
*******************************************************************************/
static cy_stc_usb_dev_cdc_comport_t* GetCom(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    return &context->port[port];
}


/*******************************************************************************
* Function Name: IsEndpointReady
****************************************************************************//**
*
* Check if endpoint state is IDLE or COMPLETED.
*
* \param endpoint
* The endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* True - endpoint is ready. False - endpoint is not ready.
*
*******************************************************************************/
static bool IsEndpointReady(uint32_t endpoint, cy_stc_usb_dev_context_t const *context)
{
    cy_en_usb_dev_ep_state_t epState;

    epState = Cy_USBFS_Dev_Drv_GetEndpointState(context->drvBase,
                                                endpoint,
                                                context->drvContext);

    return ((CY_USB_DEV_EP_IDLE == epState) || (CY_USB_DEV_EP_COMPLETED == epState));
}


