RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.c
/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_IsDataReady
****************************************************************************//**
*
* Returns status if the COM port (CDC Data interface) received data from the
* USB Host (including zero-length packet).
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* * True - the COM port (CDC Data interface) received data from the USB Host.
* * False - the COM port (CDC Data interface) is waiting for data from the
*           USB Host.
*
*******************************************************************************/
bool Cy_USB_Dev_CDC_IsDataReady(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    bool retStatus = false;
    cy_stc_usb_dev_cdc_comport_t* com = GetCom(port, context);

    if (com->valid)
    {
        retStatus = IsEndpointReady((uint32_t) com->dataOutEp, context->devContext);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_IsReady
****************************************************************************//**
*
* Returns status if the COM port (CDC Data interface) is ready for sending
* new data.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* * True - the COM port (CDC Data interface) is ready for sending new data.
* * False - the COM port (CDC Data interface) is waiting for the USB Host to
*           read previous data.
*
*******************************************************************************/
bool Cy_USB_Dev_CDC_IsReady(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    bool retStatus = false;
    cy_stc_usb_dev_cdc_comport_t* com = GetCom(port, context);

    if (com->valid)
    {
        retStatus = IsEndpointReady((uint32_t) com->dataInEp, context->devContext);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: ReadInternalBuffer
****************************************************************************//**
*
* Internal function used for copy data from internal buffer
*
* \param port
* Pointer to the port structure.
*
* \param buffer
* Pointer to the data array where data will be placed.
*
* \param size
* Number of bytes to read into the data array from the RX buffer. The maximum
* length is limited by the number of received bytes.
*
* \return
* Number of copied bytes.
*
*******************************************************************************/
static uint32_t ReadInternalBuffer(cy_stc_usb_dev_cdc_comport_t* port, uint8_t *buffer,
                         uint32_t size)
{
    uint32_t numBytes = port->writeBufIdx;
    uint32_t idx = port->readBufIdx;
    uint32_t numToCopy = (size > numBytes) ? numBytes : size;

    /* Copy data from internal buffer to the user buffer */
    (void) memcpy(buffer, &port->buffer[idx], numToCopy);
    numBytes -= numToCopy;

    /* Adjust buffer pointers */
    if (0U == numBytes)
    {
        port->readBufIdx  = 0U;
        port->writeBufIdx = 0U;
    }
    else
    {
        port->readBufIdx  += numToCopy;
        port->writeBufIdx -= numToCopy;
    }

    return numToCopy;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetData
****************************************************************************//**
*
* Read a specified number of data bytes received from USB Host by the COM port
* (CDC Data interface).
* Call \ref Cy_USB_Dev_CDC_IsDataReady function to ensure that
* data is received from the USB Host before calling this function.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param buffer
* The pointer to buffer that stores data that was read. \n
* Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
* it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
* for more information).
*
* \param size
* The number of bytes to read.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data keeping. The user must not modify
* anything in this structure.
*
* \return
* The number of bytes that were actually read.
*
*******************************************************************************/
uint32_t Cy_USB_Dev_CDC_GetData(uint32_t port, uint8_t *buffer, uint32_t size,
                                    cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    uint32_t actSize = 0U;
    cy_stc_usb_dev_cdc_comport_t * com = GetCom(port, context);

    if ((com->valid) &&
        (NULL != com->buffer) && (com->bufferSize == com->dataOutEpSize))
    {
        /* Check whether buffer has some data */
        if (com->writeBufIdx > 0U)
        {
            actSize = ReadInternalBuffer(com, buffer, size);
        }
        else
        {
            cy_en_usb_dev_status_t locStatus;
            locStatus = Cy_USB_Dev_ReadEpNonBlocking((uint32_t) com->dataOutEp, com->buffer, com->bufferSize,
                                                     &com->writeBufIdx, context->devContext);

            if (CY_USB_DEV_SUCCESS == locStatus)
            {
                actSize = ReadInternalBuffer(com, buffer, size);

