RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.c
                /* ReadEpNonBlocking returned success therefore safe to discard status */
                (void) Cy_USB_Dev_StartReadEp((uint32_t) com->dataOutEp, context->devContext);
            }
        }
    }

    return actSize;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetAll
****************************************************************************//**
*
* Read all data received from USB Host by the COM port (CDC Data interface).
* Call \ref Cy_USB_Dev_CDC_IsDataReady function to ensure that
* data is received from the USB Host before calling this function.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param buffer
* The pointer to buffer that stores data that was read. \n
* Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
* it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
* for more information).
*
* \param maxSize
* The size of buffer to read data into.
* This value must be not be less then CDC Data interface OUT endpoint maximum
* packet size that belongs to specified COM port.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* The number of bytes that were actually read.
*
*******************************************************************************/
uint32_t Cy_USB_Dev_CDC_GetAll(uint32_t port, uint8_t *buffer, uint32_t maxSize,
                               cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    uint32_t actSize = 0U;
    cy_stc_usb_dev_cdc_comport_t * com = GetCom(port, context);

    if (com->valid)
    {
        cy_en_usb_dev_status_t locStatus;

        locStatus = Cy_USB_Dev_ReadEpNonBlocking((uint32_t) com->dataOutEp, buffer, maxSize, &actSize,
                                                 context->devContext);

        /* Start read endpoint after read completed */
        if (CY_USB_DEV_SUCCESS == locStatus)
        {
            /* ReadEpNonBlocking returned success therefore safe to discard status */
            (void) Cy_USB_Dev_StartReadEp((uint32_t) com->dataOutEp, context->devContext);
        }
    }

    return actSize;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetChar
****************************************************************************//**
*
* Reads one byte of received data.
* Call \ref Cy_USB_Dev_CDC_IsDataReady function to ensure that
* data is received from the USB Host before calling this function.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Received one character or zero value to indicate there is no data.
*
*******************************************************************************/
char_t Cy_USB_Dev_CDC_GetChar(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    uint8_t  data = 0U;
    uint32_t number = Cy_USB_Dev_CDC_GetData(port, &data, 1U, context);

    if (0U == number)
    {
        data = 0U;
    }

    return (char_t) data;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_SendSerialState
****************************************************************************//**
*
* Sends the serial state notification to the host using the COM port
* (CDC interface) IN interrupt endpoint.
* Call \ref Cy_USB_Dev_CDC_IsNotificationReady function to ensure that
* COM port (CDC interface) is ready send notification before calling this
* function.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param serialState
* 16-bit value that will be sent from the USB Device to the USB Host as
* SERIAL_STATE notification using the CDC interface IN interrupt endpoint.
* Refer to revision 1.2 of the CDC PSTN Subclass specification for bit field
* definitions of the 16-bit serial state value.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
* \note
* The maximum packet size of the CDC interface IN interrupt endpoint
* (that belongs to specified COM port) must be at least 10 bytes to send
* serial state notifications.
*
*******************************************************************************/
cy_en_usb_dev_status_t Cy_USB_Dev_CDC_SendSerialState(uint32_t port, uint32_t serialState,
                                                      cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_BAD_PARAM;
    cy_stc_usb_dev_cdc_comport_t* com = GetCom(port, context);

    if ((com->valid) &&
        (CY_USB_DEV_CDC_SERIAL_STATE_SIZE <= com->commEpSize))
    {
        /* Update serial state */
        com->serialStateBitmap = (uint16_t) serialState;

        com->serialStateNotification[SERIAL_STATE_WSERIALSTATE_LSB_OFFSET] = CY_LO8(serialState);
        com->serialStateNotification[SERIAL_STATE_WSERIALSTATE_MSB_OFFSET] = CY_HI8(serialState);

        retStatus = Cy_USB_Dev_WriteEpNonBlocking((uint32_t)  com->commEp,
                                                  (uint8_t *) com->serialStateNotification,
                                                  CY_USB_DEV_CDC_SERIAL_STATE_SIZE,
                                                  context->devContext);
    }

