RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.c
    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_IsNotificationReady
****************************************************************************//**
*
* Returns if the COM port (CDC interface) is ready to send notification to
* the USB Host.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* * True - the COM port (CDC interface) is ready for sending new notification.
* * False - the COM port (CDC interface) is waiting for the USB Host to read
* previous notification.
*
*******************************************************************************/
bool Cy_USB_Dev_CDC_IsNotificationReady(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    bool retStatus = false;
    cy_stc_usb_dev_cdc_comport_t* com = GetCom(port, context);

    if (com->valid)
    {
        retStatus = IsEndpointReady((uint32_t) com->commEp, context->devContext);
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetDTERate
****************************************************************************//**
*
* Returns the data terminal rate set for this port in bits per second.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Data rate in bits per second.
*
*******************************************************************************/
uint32_t Cy_USB_Dev_CDC_GetDTERate(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(IS_COM_VALID(port));

    cy_stc_usb_dev_cdc_comport_t* com = GetCom(port, context);

    uint32_t rate = com->linesCoding[LINE_CODING_RATE_OFFSET + 3U];

    rate = (rate << 8U) | com->linesCoding[LINE_CODING_RATE_OFFSET + 2U];
    rate = (rate << 8U) | com->linesCoding[LINE_CODING_RATE_OFFSET + 1U];
    rate = (rate << 8U) | com->linesCoding[LINE_CODING_RATE_OFFSET];

    return rate;
}

#endif /* (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS)) */


/* [] END OF FILE */
